// เขียนฟังก์ชัน login ตรวจสอบสิทธิ์
function login(inputUser, inputPass, role, isActive, age) {
    
    // ตรวจ username หรือ password ไม่ถูกต้อง  ใช้ || or เพราะถ้าผิดแค่ตัวเดียวก็ = ผิดทั้งหมด
    if (inputUser !== "admin" || inputPass !== "ce385pass") {
        return "ชื่อผู้ใช้หรือรหัสผ่านไม่ถูกต้อง";
    }
    // ตรวจสถานะบัญชี isActive ถ้าเป็น false = บัญชีถูกระงับการใช้งาน
    if (isActive === false) { 
        return "บัญชีถูกระงับการใช้งาน";
    }
    // ตรวจอายุ
    if (age < 18) {
        return "อายุไม่ถึงเกณฑ์";
    }
    // กำหนดว่าผ่านแต่เป็นอาจารย์
    if (role === "อาจารย์") {
        return "เข้าสู่ระบบสำเร็จ (สิทธิ์ผู้ดูแล)";
    }
    // กำหนดว่าผ่านแต่เป็นนักศึกษา
    if (role === "นักศึกษา") {
        return "เข้าสู่ระบบสำเร็จ (สิทธิ์ทั่วไป)";
    }
    // กำหนดถ้า role ไม่ตรงกับอะไรเลย
    return "ไม่มีสิทธิ์เข้าถึงระบบ";
}
// ทดสอบระบบ 6 กรณี
console.log("=== ทดสอบการเข้าสู่ระบบ ===");

// 1 เข้าสู่ระบบได้(อาจารย์) ชื่อและรหัสถูก, ไม่โดนแบน, อายุเกิน 18, role อาจารย์
console.log("Test 1:", login("admin", "ce385pass", "อาจารย์", true, 35)); 

// 2 เข้าสู่ระบบได้(นักศึกษา) รหัสถูก, ไม่โดนแบน, อายุเกิน 18, role นักศึกษา
console.log("Test 2:", login("admin", "ce385pass", "นักศึกษา", true, 20)); 

// 3 รหัสผ่านผิด ระบบตอบกลับว่า ชื่อหรือรหัสไม่ถูก เด้งออกทันที
console.log("Test 3:", login("admin", "wrongpass123", "นักศึกษา", true, 20)); 

// 4 ชื่อผู้ใช้ผิด ระบบตอบกลับว่า ชื่อหรือรหัสไม่ถูก เด้งออกทันที) 
console.log("Test 4:", login("hacker", "ce385pass", "อาจารย์", true, 40)); 

// 5 บัญชีถูกระงับ ชื่อและรหัสถูกหมด แต่ isActive เป็น false)
console.log("Test 5:", login("admin", "ce385pass", "นักศึกษา", false, 21)); 

// 6. อายุไม่ถึงเกณฑ์ ทุกอย่งถูกแต่อายุ 15
console.log("Test 6:", login("admin", "ce385pass", "นักศึกษา", true, 15)); 


// ----------  ตอบคำถาม ---------------
/*

1. ทำไมต้องตรวจ username/password ก่อนตรวจ role
ตอบ : เพราะระบบจำเป็นต้องทำกระบวนการ "ยืนยันตัวตน" (Authentication) เพื่อตรวจสอบว่าผู้ใช้งาน
คนนั้นเป็นเจ้าของบัญชีตัวจริงและมีข้อมูลถูกต้องในระบบ ("admin" และ "ce385pass") เสียก่อน 
หลังจากนั้นระบบจึงจะสามารถเข้าไปตรวจสอบระดับสิทธิ์ (Authorization) หรือค่า role ได้อย่างปลอดภัย 
หากสลับขั้นตอนไปเช็ก role ก่อน ระบบจะไม่สามารถรู้ได้เลยว่าผู้ใช้งานที่ระบุบทบาทเข้ามานั้น 
เป็นตัวจริงหรือเป็นผู้ไม่หวังดีที่แอบอ้างสิทธิ์เข้ามา

2.ถ้าย้ายการตรวจ "อายุไม่ถึงเกณฑ์" ขึ้นไปเป็นข้อแรก จะเกิดปัญหาอะไร (คิดในแง่ความปลอดภัย: เราจะบอกอะไรกับคนที่ยังไม่ได้พิสูจน์ตัวตน)
ตอบ : ทำให้ข้อมูลส่วนตัวรั่วไหล ถ้าแฮกเกอร์สามารถสุ่มเดาชื่อผู้ใช้หรือรหัสผ่านถูก ระบบก็จะบอกว่าอายุไม่ถึงเกณฑ์ทันที 
ซึ่งเป็นการบอกข้อมูลส่วนตัวของผู้ใช้ โดยที่พวกเขาไม่มีรหัสผ่านที่ถูกต้องด้วยซ้ำ และยังไม่มีการยืนยันตัวตนว่าเป็นเจ้าของบัญชี

*/